In [3]:
import numpy as np
import pandas as pd

In [4]:
tuition_fees_dict = {
    "GASB" : [np.nan, 10000, 20000, np.nan, 10500, np.nan, np.nan],
    "FASB": [np.nan, np.nan, np.nan, 20750, np.nan, np.nan, 10000],
    "Public": [25000, np.nan, np.nan, np.nan, np.nan, np.nan, 10500],
}

In [5]:
df = pd.DataFrame(tuition_fees_dict)

In [7]:
df.reset_index(inplace=True)

In [10]:
df

   index     GASB     FASB   Public
0      0      NaN      NaN  25000.0
1      1  10000.0      NaN      NaN
2      2  20000.0      NaN      NaN
3      3      NaN  20750.0      NaN
4      4  10500.0      NaN      NaN
5      5      NaN      NaN      NaN
6      6      NaN  10000.0  10500.0

In [ ]:

#test for overlaping numbers

#replace all numbers with 1

#sum across rows

In [17]:
#drop Na values
df_1 = df[["index","GASB"]].dropna()
df_2 = df[["index", "FASB"]].dropna()
df_3 = df[["index", "Public"]].dropna()

df_1.columns = ["index", "tuition_fees"]
df_2.columns = ["index", "tuition_fees"]
df_3.columns = ["index", "tuition_fees"]

#concatenate all dataframes
df_total = pd.concat([df_1,df_2,df_3])
#remove duplicate values
df_total.drop_duplicates(subset="index", inplace=True)
#df_total = df_total.merge(df_2, on="index", how="outer")

df_total

   index  tuition_fees
1      1       10000.0
2      2       20000.0
4      4       10500.0
3      3       20750.0
6      6       10000.0
0      0       25000.0

In [24]:
series.dropna() #if I drop na I lose the fact that the 6th value was nan in all three columns

1    10000.0
2    20000.0
4    10500.0
3    20750.0
6    10000.0
0    25000.0
6    10500.0
dtype: float64

In [25]:
series.drop_duplicates() # if I drop duplicates I lose the duplicated values

0        NaN
1    10000.0
2    20000.0
4    10500.0
3    20750.0
0    25000.0
dtype: float64

In [26]:
series

0        NaN
1    10000.0
2    20000.0
3        NaN
4    10500.0
5        NaN
6        NaN
0        NaN
1        NaN
2        NaN
3    20750.0
4        NaN
5        NaN
6    10000.0
0    25000.0
1        NaN
2        NaN
3        NaN
4        NaN
5        NaN
6    10500.0
dtype: float64